{
  "lang-code": "en",
  "page-title": "CV Vladlen Kuznetsov",
  "meta-description": "CV of Vladlen Kuznetsov, QA Lead with over 4 years of experience in testing and automation.",
  "meta-keywords": "QA Lead, QA Engineer, gamedev, testing, automation, Python, Selenium, Jira, Vietnam, remote work",
  "og-title": "CV Vladlen Kuznetsov - QA Lead",
  "og-description": "CV of Vladlen Kuznetsov, QA Lead with over 4 years of experience in testing and automation.",
  "profile-photo-alt": "Vladlen Kuznetsov's Photo",
  "lang-toggle-text": "RU",

  "present-time-text": "Present",
  "resume-title": "Resume:",
  "name": "Vladlen Kuznetsov",
  "title": "QA Lead | QA Automation | QA Engineer",
  "location": "Current Location: Vietnam",
  "email": "Email",
  "about-title": "About Me",
  "about-1": "I'm a QA Lead with over 4 years of experience who doesn't just look for bugs — I build processes, find bottlenecks, and make products better. My style is <strong>owning outcomes, not just tasks</strong>. I've been the only QA in a team, launched automation from scratch, mentored juniors, led interviews, and built custom tools for log analysis. <strong>Understanding product logic better than the PM</strong>? That's me too.",
  "about-2": "QA for me isn't just about testing — it's about <strong>thinking like a user</strong> and <strong>helping the business avoid costly mistakes</strong>. I always go beyond what's in the ticket. In total, I've found and localized around <strong>3000 bugs</strong> across projects, including hundreds of critical ones.",
  "experience-title": "Work Experience",
  "qa-lead-title": "QA Lead",
  "qa-lead-duration-full": "May 2024 – Present | Gammister | United Arab Emirates · Remote Work",
  "qa-lead-1": "Initiated and developing an automated testing project in Python using AltTester + Pytest + Allure, applying OOP principles.",
  "qa-lead-2": "Wrote a game log parser that converts logs into a readable format for QA.",
  "qa-lead-3": "Developed a log analyzer to validate analytical events against a checklist, simplifying analytics verification.",
  "qa-lead-4": "Detected and localized over 2000 unique defects, including 200+ critical and 400+ high-priority ones, significantly improving product quality.",
  "qa-lead-5": "Developed and implemented a tester hiring system, partially adapted for all company positions.",
  "qa-lead-6": "Conduct interviews and candidate selection for QA positions, including preparation and evaluation of test assignments.",
  "qa-lead-7": "Mentor Junior QA, helping to develop technical and analytical skills.",
  "qa-engineer-1-title": "QA Engineer",
  "qa-engineer-1-duration": "Aug 2022 – May 2024 · 1 yr 10 mos | Gammister | United Arab Emirates · Remote Work",
  "qa-engineer-1-1": "Ensured a consistently high product rating in app stores (no less than 4.6 out of 5) by effectively preventing critical bugs.",
  "qa-engineer-1-2": "Throughout my tenure in this position, I was the sole tester in the team, responsible for the full spectrum of manual and automated product testing.",
  "qa-engineer-1-3": "Gained experience in automated testing with Python using Airtest frameworks, laying the foundation for a future automation project.",
  "qa-engineer-1-4": "Reintroduced bug report standards, improving team collaboration efficiency.",
  "qa-engineer-1-5": "Rewrote test documentation from scratch.",
  "qa-engineer-1-6": "Actively contributed to improving product quality for end users by proposing several user experience enhancements that were successfully implemented in the project.",
  "qa-engineer-1-7": "Continued applying previously acquired project management skills, occasionally creating tasks for developers.",
  "qa-engineer-1-8": "Initiated the implementation of over 15 new cheats, significantly speeding up the product testing process.",
  "qa-engineer-1-9": "Introduced the practice of testing the Game Design Document (GDD).",
  "qa-engineer-1-10": "Optimized business processes in Jira using built-in automation mechanisms.",
  "qa-engineer-1-11": "Developed and implemented a tag system in Jira, becoming the main person responsible for managing this tool in the team.",
  "qa-engineer-1-12": "Mastered Xcode, Android Studio, and ADB, and gained valuable experience in testing Android and iOS applications.",
  "qa-engineer-2-title": "QA Engineer",
  "qa-engineer-2-duration": "Oct 2021 – Aug 2022 · 11 mos | Cats Who Play | Moscow, Russia · On-site Work",
  "qa-engineer-2-1": "Participated in testing a commercially successful PC game from a globally renowned franchise, which received highly positive reviews from players.",
  "qa-engineer-2-2": "Throughout my time at the company, I was the sole tester in the team, responsible for the full spectrum of manual testing and elements of automated testing.",
  "qa-engineer-2-3": "Over 11 months, detected and localized over 850 unique defects (excluding those found during regression testing), significantly improving the quality of the final product.",
  "qa-engineer-2-4": "Developed scripts for automated testing of levels on the company's internal engine.",
  "qa-engineer-2-5": "Introduced bug report standards, improving team collaboration efficiency.",
  "qa-engineer-2-6": "Wrote test documentation from scratch.",
  "qa-engineer-2-7": "Actively contributed to improving product quality for end users by proposing several gameplay enhancements that were successfully implemented in the project.",
  "qa-engineer-2-8": "Gained project management skills, including creating technical specifications for developers based on management requirements.",
  "qa-engineer-2-9": "Using AI technologies, created and integrated English voiceovers for all in-game dialogues for investor presentations.",
  "skills-title": "Skills",
  "certificates-title": "Certificates",
  "certificates-text": "Most of my certificates can be found here:",
  "certificates-link": "View Certificates",

  "year-abbr": "yr",
  "month-abbr": "mos",
  "day-abbr": "days",
  "hour-abbr": "hrs",
  "minute-abbr": "min",
  "second-abbr": "sec",
  "duration-just-started": "just started"
}