{
  "lang-code": "ru",
  "page-title": "CV Кузнецов Владлен",
  "meta-description": "Резюме Кузнецова Владлена, QA Lead с  более чем 4 летним опытом в, тестировании и автоматизации.",
  "meta-keywords": "QA Lead, QA Engineer, геймдев, тестирование, автоматизация, Python, Selenium, Jira, Вьетнам, удаленная работа",
  "og-title": "CV Кузнецов Владлен - QA Lead",
  "og-description": "Резюме Кузнецова Владлена, QA Lead с более чем 4 летним опытом в, тестировании и автоматизации.",
  "profile-photo-alt": "Фото Владлена Кузнецова",
  "lang-toggle-text": "EN",
  "download-pdf-button-text": "Скачать в PDF",

  "present-time-text": "настоящее время",

  "resume-title": "Резюме:",
  "name": "Кузнецов Владлен",
  "title": "QA Lead | QA Automation | QA Engineer",
  "location": "Текущая локация: Вьетнам",
  "email": "Email",
  "about-title": "Обо мне",
  "about-1": "Я — QA-лид с 4 годами опыта, который умеет не просто искать баги, а выстраивать процессы, находить узкие места и делать продукт лучше. Мой стиль — <strong>брать ответственность, а не таски</strong>. За карьеру довелось быть единственным QA в команде, запускать автоматизацию с нуля, менторить новичков, проводить собеседования и писать тулзы для лог-анализа. <strong>Разбираться в логике продукта глубже, чем продакт</strong> — это тоже про меня.",
  "about-2": "QA для меня — это не просто «тестировать», а <strong>думать как пользователь</strong> и <strong>помогать бизнесу не терять деньги на ошибках</strong>. Я всегда делаю чуть больше, чем написано в задачах. Суммарно на проектах нашёл и локализовал около <strong>3000 багов</strong>, включая сотни критичных.",
  "experience-title": "Опыт работы",
  "qa-lead-title": "QA Lead",
  "qa-lead-duration-full": "май 2024 г. – настоящее время | Gammister | Объединённые Арабские Эмираты · Удалённая работа",
  "qa-lead-1": "Инициировал и разрабатываю проект по автоматизированному тестированию на Python с использованием AltTester + Pytest + Allure, применяя принципы ООП.",
  "qa-lead-2": "Написал парсер логов игры, преобразующий их в удобочитаемый формат для QA.",
  "qa-lead-3": "Разработал лог-анализатор для валидации аналитических ивентов по чек-листу, упростив проверку аналитики.",
  "qa-lead-4": "Обнаружил и локализовал более 2000 уникальных дефектов, включая 200+ критических и 400+ высокоприоритетных, существенно повысив качество продукта.",
  "qa-lead-5": "Разработал и внедрил систему найма тестировщиков, частично адаптированную для всех позиций в компании.",
  "qa-lead-6": "Провожу интервью и отбор кандидатов на позиции QA, включая подготовку и проверку тестовых заданий.",
  "qa-lead-7": "Менторю Junior QA, помогая развивать технические и аналитические навыки.",


  "qa-engineer-1-title": "QA Engineer",
  "qa-engineer-1-duration": "авг. 2022 г. – май 2024 г. · 1 г. 10 мес. | Gammister | Объединённые Арабские Эмираты · Удалённая работа",
  "qa-engineer-1-1": "Обеспечил стабильно высокий рейтинг продукта в магазинах приложений (не ниже 4.6 из 5 баллов) благодаря эффективному предотвращению критических багов.",
  "qa-engineer-1-2": "На протяжении всего времени работы на текущей должности, был единственным тестировщиком в команде, отвечая за полный спектр ручного и элементы автоматизированного тестирования продукта.",
  "qa-engineer-1-3": "Заложил основу для проекта по автоматизации тестирования, приобретя опыт работы с Python и фреймворком Airtest.",
  "qa-engineer-1-4": "Разработал и внедрил стандарты документирования дефектов (баг-репортов), что повысило эффективность взаимодействия в команде и скорость исправления ошибок.",
  "qa-engineer-1-5": "Создал и поддерживал в актуальном состоянии комплексную тестовую документацию, обеспечив полное покрытие функционала.",
  "qa-engineer-1-6": "Активно способствовал повышению качества продукта для конечных пользователей, предложив несколько идей по улучшению опыта пользователей, которые были успешно внедрены в проект.",
  "qa-engineer-1-7": "Продолжил применять приобретённые ранее навыки проектного менеджмента, составляя задания для разработчиков.",
  "qa-engineer-1-8": "Инициировал внедрение более 15 новых внутриигровых инструментов (читов), существенно ускоривших процесс тестирования продукта.",
  "qa-engineer-1-9": "Внедрил практику тестирования игрового дизайн-документа (ГДД), что позволило выявлять логические ошибки на ранних этапах.",
  "qa-engineer-1-10": "Оптимизировал рабочие процессы в Jira с помощью встроенных механизмов автоматизации, сократив время на рутинные операции.",
  "qa-engineer-1-11": "Разработал и внедрил систему тегов в Jira для классификации задач и дефектов, став ответственным за ее поддержку и развитие в команде.",
  "qa-engineer-1-12": "Освоил Xcode, Android Studio и ADB для углубленного тестирования и отладки мобильных приложений (Android и iOS).",


  "qa-engineer-2-title": "QA Engineer",
  "qa-engineer-2-duration": "окт. 2021 г. – авг. 2022 г. · 11 мес. | Cats Who Play | Москва, Россия · Работа в офисе",
  "qa-engineer-2-1": "Участвовал в тестировании коммерчески успешной компьютерной игры, по всемирно известной франшизе, получившей очень положительные отзывы от игроков. Это стало моим стартом в GameDev.",
  "qa-engineer-2-2": "На протяжении всего времени работы в компании был единственным тестировщиком в команде, отвечая за полный спектр ручного и элементы автоматизированного тестирования продукта.",
  "qa-engineer-2-3": "За 11 месяцев работы обнаружил и локализовал более 850 уникальных дефектов (не считая выявленных при регрессионном тестировании), что существенно повысило качество конечного продукта.",
  "qa-engineer-2-4": "Разрабатывал скрипты для автоматизированного тестирования уровней на внутреннем движке компании.",
  "qa-engineer-2-5": "Внедрил стандарты составления баг-репортов, повысив эффективность взаимодействия в команде.",
  "qa-engineer-2-6": "Написал с нуля тестовую документацию",
  "qa-engineer-2-7": "Активно способствовал повышению качества продукта для конечных пользователей, предложив несколько идей по улучшению игрового процесса, которые были успешно внедрены в проект.",
  "qa-engineer-2-8": "Приобрел навыки проектного менеджмента, включая составление технических заданий для разработчиков на основе требований руководства.",
  "qa-engineer-2-9": "Используя AI-технологии, создал и интегрировал англоязычную озвучку всех диалогов в игре для презентации инвесторам.",
  "skills-title": "Навыки",

  "languages-title": "Языки",
  "lang-english": "Английский – B1",
  "lang-russian": "Русский – Родной",
  "lang-vietnamese": "Вьетнамский – A2",

  "articles-title": "Мои статьи",
  "article-1-title": "Как я ускорил анализ логов в мобильной игре с помощью Python-конвертера",
  "article-1-description": "Моя первая публикация на Habr. Я горжусь ей, так как ей удалось пройти жесткий отбор песочницы и сразу же попасть в основной раздел сайта.",
  "article-1-link-text": "Читать на Habr",

  "year-abbr": "г.",
  "month-abbr": "мес.",
  "day-abbr": "дн.",
  "hour-abbr": "ч.",
  "minute-abbr": "мин.",
  "second-abbr": "сек.",
  "duration-just-started": "только началось"
}